<?php

namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\Area;
use App\Models\City;

class AreaSeeder extends Seeder
{
    public function run()
    {
        $areas = [
            'الرياض' => [
                'الملز', 'السويدي', 'العليا', 'النخيل', 'الشفا', 'اليرموك', 'النسيم', 'المرسلات',
                'الواحة', 'المروج', 'الروضة', 'الازدهار', 'قرطبة', 'غرناطة'
            ],
            'جدة' => [
                'الصفا', 'السلامة', 'الحمراء', 'البوادي', 'النسيم', 'مشرفة', 'النزهة', 'الشرفية',
                'بني مالك', 'السامر', 'الفيصلية', 'المحمدية', 'الرحاب', 'العزيزية'
            ],
            'مكة المكرمة' => [
                'العزيزية', 'الشوقية', 'النسيم', 'الزاهر', 'النوارية', 'المسفلة', 'الكعكية',
                'جرول', 'الخالدية', 'الهجرة', 'بطحاء قريش', 'العتيبية'
            ],
            'المدينة المنورة' => [
                'قباء', 'العوالي', 'العزيزية', 'الخالدية', 'النصر', 'الفيصلية', 'الدعيثة', 'النخيل',
                'الهجرة', 'شوران', 'حي البحر', 'الصافية'
            ],
            'الدمام' => [
                'الراكة', 'الفيصلية', 'الشعلة', 'البديع', 'الضباب', 'الريان', 'الشفاء',
                'الزهور', 'النزهة', 'العروبة', 'الاتصالات', 'الجامعيين'
            ],
            'الخبر' => [
                'العليا', 'الراكة', 'الخزامى', 'الصفا', 'الخبر الشمالية', 'الواحة', 'العزيزية',
                'البندرية', 'الهدا', 'الثقبة', 'الحزام الذهبي'
            ],
            'بريدة' => [
                'الفايزية', 'الناصرية', 'الريان', 'الصفا', 'الروضة', 'الصفراء', 'الوسيطى',
                'المنتزه', 'الخليج', 'النور', 'النهضة', 'الربوة'
            ],
            'تبوك' => [
                'الصفا', 'السعادة', 'الريان', 'الروضة', 'الحمراء', 'السلام', 'الهدا', 'النخيل',
                'الزهور', 'المروج', 'المنار', 'البساتين'
            ],
            'الطائف' => [
                'النسيم', 'الشهداء', 'المثناة', 'الخالدية', 'الوسام', 'الحوية', 'العزيزية',
                'الشفاء', 'الرميدة', 'السداد', 'قروى', 'الوحدة'
            ],
            'أبها' => [
                'المنسك', 'المروج', 'الشفاء', 'الريان', 'السروات', 'القريقر', 'الواديين',
                'المشهد', 'الضباب', 'الورود', 'الفرعاء', 'المحالة'
            ],
        ];


        foreach ($areas as $cityName => $areaList) {
            $city = City::where('name', $cityName)->first();

            foreach ($areaList as $area) {
                Area::create([
                    'name' => $area,
                    'city_id' => $city->id
                ]);
            }
        }
    }
}
